In [2]:
import numpy as np
import pandas as pd

In [19]:
df=pd.read_csv('countries.csv')
df=temp
df.head()

             name     area
0         Albania    28748
1         Algeria  2381741
2  American Samoa      199
3         Andorra      468
4          Angola  1246700

In [10]:
#to remove unwanted columns
processed=df.drop(['country_code2','country_code3'],axis=1)#to drop columns,axis=1, for rows axis=0
processed

             name     area
0         Albania    28748
1         Algeria  2381741
2  American Samoa      199
3         Andorra      468
4          Angola  1246700

In [23]:
'''When inplace = True , the data is modified in place, which means it will return nothing and the dataframe 
is now updated. When inplace = False , which is the default, then the operation is performed and it returns 
a copy of the object. You then need to save it to something.'''

# temp.drop(['country_code2','country_code3'],axis=1,inplace=True)#default inplace=False

'When inplace = True , the data is modified in place, which means it will return nothing and the dataframe \nis now updated. When inplace = False , which is the default, then the operation is performed and it returns \na copy of the object. You then need to save it to something.'

             name     area
0         Albania    28748
1         Algeria  2381741
2  American Samoa      199
3         Andorra      468
4          Angola  1246700

In [31]:
df1=pd.read_csv('countries.csv') #nan in file are empty 
df1

             name       area country_code2 country_code3
0         Albania        NaN            AL           ALB
1         Algeria  2381741.0            DZ           DZA
2  American Samoa    12333.0            AS           ASM
3         Andorra      468.0            AD           NaN
4          Angola        NaN            AO           AGO

In [34]:
df1.isnull()
#wherever true,is empty

    name   area  country_code2  country_code3
0  False   True          False          False
1  False  False          False          False
2  False  False          False          False
3  False  False          False           True
4  False   True          False          False

In [36]:
df1.isnull().sum()
#tells total number of empty spaces in each column

name             0
area             2
country_code2    0
country_code3    1
dtype: int64

In [38]:
df1.dropna()#removes rows having any null values

             name       area country_code2 country_code3
1         Algeria  2381741.0            DZ           DZA
2  American Samoa    12333.0            AS           ASM